function Vet(input){
    let days = Number(input[0]);
    let hoursperDay = Number(input[1]);
    let toll = 0;
    let tollTotal = 0;
    for (let i = 1; i <= days; i++){
         for (let n = 1; n <= hoursperDay; n++){
               let isDayEven = i % 2 === 0;
               let isHourEven = n % 2 === 0;
               
               if (isDayEven && !isHourEven){
                toll += 2.5;
               }else if (!isDayEven && isHourEven){
                toll += 1.25;
               }else{
                toll += 1;
               }
         }
         console.log(`Day: ${i} - ${toll.toFixed(2)} leva`);
         tollTotal += toll;
         toll = 0;
       


    }console.log(`Total: ${tollTotal.toFixed(2)} leva`);

}Vet(["2", "5"])
//Деси трябва да заведе котката си на ветеринар, но паркингът се заплаща. Напишете програма, 
//която пресмята колко общо трябва да се плати за престоя на колата на Деси на паркинга.
// Паркингът е различен от останалите и има разнообразен ценоразпис.
// За всеки четен ден и нечетен час, паркингът таксува 2.50 лева. 
//Във всеки нечетен ден и четен час таксата е 1.25 лева, във всички останали случаи се заплаща 1 лев. 
//Таксуването става на всеки изминал час от деня.
// Всеки един от изходите трябва да бъде закръглен до втория знак след десетичната запетая.
//От конзолата се четaт два реда:
// Брой дни – цяло число в интервала [1 … 5]
//Брой часове за всеки един от дните - цяло число в интервала [1 … 24]
//Да се отпечата на конзолата:
 //За всеки изминал ден, общата сума, която трябва да се плати://"Day: {индексът на деня} – {общата сума за деня} leva"
//Когато програмата приключи:
//"Total: {общата сума за всички дни} leva"